{
    "plot": {
        "texts": [
        "A struggling artist gains fame at a personal cost.",
        "A celebrity faces the downfall of their career.",
        "A ghost haunts a family in their new home.",
        "A family befriends a ghost in their home.",
        "A scientist creates a life-changing invention.",
        "A scientist destroys a life-changing invention.",
        "A family brings someone new into their life.",
        "A family abandons someone in their life.",
        "A person wakes up with amnesia and uncovers a dark past.",
        "A person wakes up with amnesia and uncovers a happy past.",
        "A child finds a doorway to a magical world.",
        "A child finds a doorway to a world devoid of joy.",
        "A person starts seeing visions of the future.",
        "A person starts seeing visions of the past.",
        "A space crew embarks on a distant mission.",
        "A space crew embarks on a mission back home.",
        "Children discovers they are superheroes.",
        "Adults discovers they are superheroes.",
        "A community grapples with the arrival of a mysterious stranger.",
        "A community grapples with the death of a mysterious stranger.",
        "A retired detective returns for a final case.",
        "A new detective is on their first case.",
        "A person struggles to break free from a cult.",
        "A person joins a cult.",
        "A journalist uncovers scandal in a powerful organization.",
        "A journalist hides scandal in a powerful organization.",
        "An ancient prophecy indicates the world will end soon.",
        "An ancient prophecy indicates a new world will be born soon.",
        "A lawyer takes on a big corporation in a groundbreaking case.",
        "A lawyer helps a big corporation in a groundbreaking case.",
        "A group of friends hunt for treasure.",
        "A group of friends hide treasure together.",
        "An amateur sleuth tries to solve a local mystery.",
        "An amateur sleuth tries to solve a global mystery.",
        "A historical figure is transported to the modern world.",
        "A historical figure is transported to the past.",
        "A family trip leads to unexpected adventures.",
        "A friends trip leads to unexpected adventures.",
        "A warrior embarks on a quest to save a kingdom.",
        "A warrior embarks on a quest to destroy a kingdom.",
        "A group of rebels fight a tyrannical government.",
        "A group of rebels build a tyrannical government.",
        "A tech genius builds a sentient robot.",
        "A tech genius fails at building a sentient robot.",
        "A writer’s fictional creation comes to life.",
        "A sculptor’s fictional creation comes to life.",
        "A couple swaps lives with another couple for a week.",
        "A family swaps lives with another family for a week.",
        "An athlete faces a career-ending injury.",
        "An athlete returns to their sport after injury.",
        "A famous musician loses their ability to hear.",
        "An aspiring musician gains their ability to hear.",
        "A community faces an invasion.",
        "A community avoids an invasion.",
        "A person is falsely accused of a crime.",
        "A person is accurately accused of a crime.",
        "A spy infiltrates an enemy organization.",
        "A spy infiltrates their own government.",
        "Someone attempts to prevent a tragedy.",
        "Someone attempts to create a tragedy.",
        "Someone learns they are an heir.",
        "Someone learns they are no longer an heir.",
        "An alien lands on a new planet.",
        "An alien tries to escape a planet.",
        "A person navigates a world where lying is impossible.",
        "A person navigates a world where lying is unavoidable.",
        "Two best friends start a business together.",
        "Two enemies start a business together.",
        "A hiker gets lost in the wilderness.",
        "Hikers find each other in the wilderness.",
        "A former criminal tries to start a new life.",
        "A convicted criminal tries to navigate jail.",
        "A group survives a natural disaster.",
        "An individual survives a natural disaster.",
        "A couple tries to renovate a dilapidated house.",
        "A couple tears down a dilapidated house.",
        "A child prodigy struggles to build a normal life.",
        "An adult genius struggles to build a normal life.",
        "A person searches for their birth parents.",
        "A person avoids their birth parents.",
        "An underdog tries to win a championship.",
        "A star tries to lose a championship.",
        "A person travels back in time and alters history.",
        "A person travels to the future and alters history.",
        "A detective solves a high-profile murder case.",
        "A detective solves a low-profile murder case.",
        "Two people from different worlds fall in love.",
        "Two people from different worlds fall out of love.",
        "Strangers are stranded on a deserted island.",
        "Friends are stranded on a deserted island.",
        "A person discovers they have magical abilities.",
        "A person loses their magical abilities.",
        "An ordinary person inherits a fortune.",
        "An wealthy person loses their fortune.",
        "A corporate worker starts a new life.",
        "A hoodlum enters the corporate world.",
        "A writer embarks on adventure in search of inspiration.",
        "A writer takes a break.",
        "A hair stylist changes someone's life.",
        "A hair stylist starts a new life.",
        "A contractor signs the deal of their life.",
        "A contractor loses the deal of their life.",
        "A tech leader starts a new venture.",
        "A tech leader shuts their business doors.",
        "Wild: Come up with your own plot."]
    },
    "type": {
        "headings": [
        "Legend",
        "Parable",
        "Science Fiction",
        "Mystery",
        "Horror",
        "Adventure",
        "Satire",
        "Parody",
        "Romance",
        "Realistic",
        "Utopian",
        "Fairytale",
        "Myth",
        "Dystopian",
        "Crime",
        "Fantasy",
        "Historical Fiction",
        "Thriller",
        "Comedy",
        "Tragedy",
        "Psychological Drama",
        "Coming-of-Age",
        "Action",
        "Espionage",
        "Western",
        "Political Drama",
        "Martial Arts",
        "Biographical",
        "Slice of Life",
        "Supernatural",
        "Heist",
        "Wild"            
        ],
        "texts": [
        "Often feature heroes, and are rooted in historical events or figures that may be exaggerated over time.",
        "Used to illustrate a moral or spiritual lesson.",
        "Explores imaginative concepts such as futuristic technology, space exploration, time travel, parallel universes, and extraterrestrial life.",
        "Revolves around the solving of a crime or unraveling of secrets.",
        "Frightening and unsettling, often deals with the supernatural or macabre.",
        "An exciting journey, often including quests or voyages.",
        "Uses humor and irony to criticize societal norms, politics, and human follies.",
        "Comically imitates specific works, styles, or genres to exaggerate their features for humorous effect.",
        "Follows the romantic or love relationship between characters.",
        "Shows everyday life accurately, without exaggerated stories or unusual settings.",
        "An imagined future or alternate society that explores the positive implications of political and social structures.",
        "Involving magical and fantastical elements, conflict between good and evil, with good usually prevailing.",
        "Explains nature, culture, or big ideas, often involving gods and mythical beings.",
        "A grim society often under oppressive control, showing the degradation of utopian ideals.",
        "Focuses on the planning, execution, and aftermath of an unlawful act.",
        "Features magical or supernatural forces, otherworldly creatures, and new worlds.",
        "Set in the past, often during a significant event or period, and featuring historical figures or situations.",
        "A fast-paced story full of suspense, unexpected twists, and high stakes that keeps the audience on edge.",
        "Emphasizes humor, with situations and dialogues designed to provoke laughter and amusement.",
        "Involves serious and important events that lead to a disastrous end for the protagonist.",
        "Explores the emotional and psychological states of complex characters.",
        "Centers on the growth of a protagonist from youth to adulthood, often tied to personal and emotional development.",
        "Features dynamic sequences and physical activities, often with a hero facing off against villains.",
        "Deals with spies and secret agents, involving covert operations and intelligence gathering.",
        "Highlights the ruggedness of the landscape and the individuals during a westward expansion.",
        "Focuses on the intrigue and maneuverings of political figures and the power plays within a government or organization.",
        "Focuses on martial arts and the skills and philosophies behind them.",
        "Chronicles significant events, achievements, and personal aspects of an individual’s life story.",
        "Focuses on ordinary aspects of life, emphasizing realism and naturalism.",
        "Centers on unexplainable events, involving ghosts, spirits, or other supernatural elements.",
        "Revolves around the intricate planning and daring execution of a theft or complex robbery.",
        "Come up with your own type."            
        ]
    },
    "setting": {
        "headings": [
        "Historical",
        "Fantasy",
        "Futuristic",
        "Urban",
        "Travel",
        "Rural",
        "Far Away",
        "Small Town",
        "War",
        "Space",
        "Aquatic",
        "Cyberspace",
        "Workplace",
        "Royal",
        "Post-apocalyptic",
        "Realms",
        "Travel",
        "Haunted",
        "Suburban",
        "High School",
        "Noir",
        "Hospital",
        "Island Retreat",
        "Jungle",
        "Desert Oasis",
        "Arctic Station",
        "Mountain Village",
        "Underground City",
        "Boarding School",
        "Ghost Town",
        "Steampunk Metropolis",
        "Wild"
        ],
        "texts": [
        "A specific and often well-defined past time period.",
        "A world crafted from imagination, with its own lore, landscapes, and fantastical beings.",
        "Envisioning time ahead with advanced technologies, new societal structures, or interstellar exploration.",
        "Characterized by city life, with its bustling communities, architectural landscapes, and dynamic cultures.",
        "Changes throughout the story, focusing on the journey itself, whether physical or metaphorical.",
        "Capturing the essence of life in the countryside or remote pastoral settings, close to nature.",
        "Isolated or confined spaces that evoke solitude, like deserted islands or hidden retreats.",
        "Embodying tight-knit communities and local traditions within quaint, less populated towns.",
        "Centered on conflict, detailing the experiences of those involved in or affected by warfare.",
        "Set in the cosmos, aboard spaceships or on alien planets, exploring the extraterrestrial.",
        "Featuring marine settings, exploring the mysteries and life forms of underwater worlds.",
        "Digital landscapes, focusing on the realms within computers and the internet.",
        "Professional environments, where occupational dynamics play out.",
        "Inside regal courts or palaces, rich with political intrigue and power struggles.",
        "Survival in worlds reshaped by disaster, where society has to rebuild or adapt.",
        "Encompassing alternate dimensions or lands imbued with magic, often unseen by the ordinary.",
        "Following journeys that can be literal travels or metaphorical passages, focusing on the voyage.",
        "Spine-chilling and supernatural, featuring ghosts or paranormal events in ominous settings.",
        "Life in residential neighborhoods, highlighting family dynamics and community interactions.",
        "Teenage experiences and growth in an educational setting, blending social challenges with personal development.",
        "Crime and moral ambiguity in dark urban settings, featuring hard-boiled characters and complex plots.",
        "A healthcare facility providing patient treatment with specialized medical and nursing staff and medical equipment.",
        "A secluded island, exploring isolation and the dynamics of a limited community.",
        "Deep within untamed jungles, focusing on survival and the mysteries of nature.",
        "Life and challenges in a sparse desert environment centered around an oasis.",
        "A remote polar research station, dealing with extreme cold and isolation.",
        "Life in a high-altitude, secluded village, with a focus on local culture and traditions.",
        "A subterranean urban setting, exploring life beneath the earth’s surface.",
        "A residential school, often far from a student’s home.",
        "Exploration and mystery in a deserted town, once thriving, now abandoned.",
        "A bustling city blending Victorian-era aesthetics with futuristic steam-powered technology and inventions.",
        "Come up with your own setting."            
        ]
    },
    "tone": {
        "headings": [
        "Serious",
        "Playful",
        "Satirical",
        "Optimistic",
        "Melancholic",
        "Dreamy",
        "Pessimistic",
        "Romantic",
        "Nostalgic",
        "Whimsical",
        "Aggressive",
        "Detached",
        "Ironic",
        "Reflective",
        "Somber",
        "Cynical",
        "Informative",
        "Foreboding",
        "Melodramatic",
        "Euphoric",
        "Mysterious",
        "Solemn",
        "Suspenseful",
        "Inspirational",
        "Mystical",
        "Nostalgic",
        "Exhilarating",
        "Contemplative",
        "Surreal",
        "Uplifting",
        "Wild"           
        ],
        "texts": [
        "Treats its subjects with importance and often with little to no humor.",
        "Seeks to inspire joy and lightheartedness.",
        "Uses humor and criticism to highlight and mock societal or individual faults.",
        "Anticipates favorable outcomes and sees situations in a bright, encouraging light.",
        "Contemplates loss, unfulfilled desires, or life’s deeper, more somber aspects.",
        "Conveys a sense of whimsy, softness, and a touch of fantasy.",
        "Focuses on the negative, frequently anticipating unfavorable outcomes.",
        "Centers on deep feelings, the beauty of love, and the sublime aspects of nature.",
        "Evokes a tender remembrance of the past and its cherished moments.",
        "Expresses playfulness, often leading to unpredictable outcomes.",
        "Displays a combative or challenging attitude, sometimes leading to conflict.",
        "Maintains an unbiased and dispassionate standpoint, often seeming disconnected.",
        "Conveys humor or emphasis by saying the opposite of what is meant.",
        "Engages in deep thought, exploring significant meanings or personal insights.",
        "Carries a heavy atmosphere, often dealing with grave or reflective themes.",
        "Characterized by disbelief in sincerity or goodness, often questioning motives.",
        "Aims to provide knowledge or convey information clearly and effectively.",
        "Creates a sense of impending danger or a feeling that something bad will happen.",
        "Amplifies emotions and drama, often at the expense of realism.",
        "Portrays a sense of overwhelming happiness or high spirits.",
        "Keeps the audience guessing with puzzles or secrets to uncover.",
        "Characterised by deep sincerity, free from jesting or triviality.",
        "Maintains high anxiety and anticipation about what may happen.",
        "Encourages and instills optimism or the desire to achieve something great.",
        "Creates a sense of wonder and magic, often involving supernatural elements or mythical lore.",
        "Evokes a longing for the past, often with a warm and tender portrayal of memories.",
        "Delivers a fast-paced, high-energy experience, often with suspenseful or adventurous elements.",
        "Encourages deep thinking and reflection, often exploring philosophical or existential themes.",
        "Presents an unreal, fantastical world that defies logic, creating a mesmerizing and strange atmosphere.",
        "Offers a feel-good experience, often emphasizing themes of love, friendship, and kindness.",
        "Come up with your own tone."            
        ]
    }
}
